[
  "What's a hobby you've always wanted to try but haven't yet?",
  "Describe your perfect day, from morning to night.",
  "What's one thing that always makes you laugh?",
  "Share a memorable moment from your childhood.",
  "What's your favorite book or movie, and why?",
  "What's a skill you'd love to learn?",
  "Describe your dream vacation.",
  "What's one thing on your bucket list?",
  "What's your favorite way to relax after a long day?",
  "If you could have dinner with anyone, living or dead, who would it be?",
  "What's a song that you can listen to on repeat?",
  "What's something you're really proud of?",
  "If you could live in any era, when would it be?",
  "What's your most treasured possession?",
  "What's a tradition that's important to you?",
  "What's your favorite holiday, and how do you like to celebrate it?",
  "What's a place you've always wanted to visit?",
  "If you could have any superpower, what would it be?",
  "What's a talent you wish you had?",
  "What's something you're grateful for today?",
  "What's your favorite part about your job or school?",
  "Tell me about a project you're currently working on or excited about.",
  "Who are your closest friends, and what do you value most in your friendships?",
  "What qualities are most important to you in a friendship?",
  "What are you looking for in a relationship?",
  "How do you like to spend your weekends?",
  "What's your favorite local spot to hang out?",
  "What's a typical day like for you?",
  "What's a recent achievement you're proud of?",
  "What's your favorite way to unwind after a busy week?",
  "How do you stay motivated in your work or studies?",
  "What's a new skill or hobby you've picked up recently?",
  "Who in your life has had the biggest impact on you?",
  "What's your favorite family tradition?",
  "How do you like to celebrate your birthday?",
  "What's a cause or issue you're passionate about?",
  "Describe a perfect weekend for you.",
  "What's your favorite type of cuisine?",
  "What's a book or movie that influenced you significantly?",
  "What's an important life lesson you've learned recently?",
  "What's your favorite childhood memory?",
  "What's the best advice you've ever received?",
  "What's a subject you're passionate about?",
  "What's your go-to comfort food?",
  "What's a place that holds special meaning to you?",
  "What's something adventurous you've always wanted to try?",
  "What's a habit you're trying to develop or break?",
  "What's your favorite form of exercise or physical activity?",
  "If you could meet any historical figure, who would it be and why?",
  "What's a personal goal you have for this year?"
]
