[
  "What's an adventurous date idea you'd like to try?",
  "What's a fantasy you feel comfortable sharing?",
  "What's something new you'd like to explore together?",
  "What's your favorite memory of us so far?",
  "What's a romantic movie scene you love?",
  "What's something that always puts you in a romantic mood?",
  "Describe a perfect romantic evening.",
  "What's a way you like to show physical affection?",
  "What's something that makes you feel desired?",
  "What's a song that makes you think of romance?",
  "What's a romantic dream you've had?",
  "What's an intimate experience you treasure?",
  "What's a little thing I do that you find really attractive?",
  "What's a place where you've always wanted to make love?",
  "What's a romantic risk you'd like to take?",
  "What's something flirty you've always wanted to say?",
  "What's your favorite thing about our physical connection?",
  "What's a sensual food you'd like to share?",
  "Describe your ideal date night.",
  "What's a romantic surprise you'd love to give or receive?",
  "What's a romantic fantasy you haven't shared before?",
  "Describe an ideal romantic getaway.",
  "What's something playful you'd like to try together?",
  "What's a romantic gesture that means a lot to you?",
  "What's an aspect of our physical connection you cherish?",
  "What's a romantic challenge you'd like to overcome?",
  "Share a romantic or sensual aspiration you have.",
  "What's something that makes you feel deeply connected?",
  "Describe a romantic surprise that would delight you.",
  "What's a piece of romantic advice you believe in?",
  "How do you feel about public displays of affection?",
  "What's something in the bedroom you're curious about?",
  "What's a romantic habit you'd like to develop?",
  "Describe a romantic movie scene you'd like to recreate.",
  "What's a secret romantic wish you have?",
  "How do you like to be seduced?",
  "What's a romantic song that encapsulates your feelings?",
  "What's a romantic skill you pride yourself on?",
  "Share a romantic memory that's dear to you.",
  "What's a playful or adventurous date you dream of?",
  "What's a romantic tradition you'd like to start or continue?",
  "What's your idea of a perfect romantic gesture?",
  "What's something romantic that you've always wanted to try?",
  "How do you define intimacy and its importance in our relationship?",
  "What's a sensual experience you've always wanted to share?",
  "What's your favorite romantic quote or saying?",
  "What's a romantic skill or talent you wish to acquire?",
  "What's an unexpected way to express love?",
  "What's a romantic setting or location you fantasize about?",
  "What's a personal romantic goal you have for our relationship?"
]
