[
  "Where do you see yourself in five years?",
  "What's a dream you're hesitant to pursue, and why?",
  "If you could achieve one thing without failure, what would it be?",
  "What's your idea of success?",
  "How do you want to be remembered?",
  "What's a dream vacation you hope to take one day?",
  "What's something you hope to achieve together?",
  "What's a skill or hobby you want to master?",
  "What kind of legacy do you want to leave?",
  "What's an adventure you want to experience?",
  "If you could start any project without limitations, what would it be?",
  "What's something you've always wanted to create?",
  "What's a cause that's important to you?",
  "What does your dream home look like?",
  "What's a goal you've set for this year?",
  "What's a change you hope to see in the world?",
  "If you could write a book, what would it be about?",
  "What's a career aspiration you have?",
  "What's a habit you want to develop?",
  "What's a tradition you'd like to start?",
  "What's a skill you hope to master in the next few years?",
  "What's an important milestone you're looking forward to?",
  "What's a culture or country you'd love to explore?",
  "How do you envision your ideal retirement?",
  "What's a creative endeavor you'd like to undertake?",
  "What's a life experience you believe everyone should have?",
  "What's an area of knowledge you'd like to dive deeper into?",
  "How do you want to improve your community or the world?",
  "What's a personal trait you'd like to develop?",
  "What's a language you'd love to learn?",
  "What's a significant change you'd like to make in your life?",
  "How do you picture your family life in the future?",
  "What's a philanthropic cause you'd like to be involved in?",
  "What's a business or project idea you'd like to launch?",
  "What's a personal challenge you'd like to overcome?",
  "How do you want to evolve in your career?",
  "What's an unconventional life experience you'd like to try?",
  "What's a subject or skill you wish to teach others?",
  "What's an environmental issue you're passionate about?",
  "What's a technological advancement you're excited to see?",
  "What's a personal aspiration that excites you?",
  "How do you hope to grow emotionally and spiritually?",
  "What's a piece of wisdom you'd like to pass on?",
  "What's an important cultural tradition you want to maintain or start?",
  "What's a societal change you strongly advocate for?",
  "What's an artistic or creative skill you wish to explore?",
  "What does lifelong learning mean to you?",
  "What's a health or fitness goal you have?",
  "What's a fantasy trip you'd love to plan?",
  "What's an aspect of your personality you'd like to develop more?"
]
