[
  "What's a challenge you've overcome that's shaped who you are?",
  "How do you define love?",
  "What's a lesson you've learned from a past relationship?",
  "What does trust mean to you in a relationship?",
  "What's something that scares you about relationships?",
  "What's your most significant accomplishment?",
  "How do you handle conflict in a relationship?",
  "What are your thoughts on forgiveness?",
  "What's a personal goal you're currently working towards?",
  "What does a balanced life look like to you?",
  "What qualities do you value most in a partner?",
  "How do you express affection?",
  "What's something you've always wanted to tell someone but haven't?",
  "What's an experience that has profoundly changed you?",
  "What are your thoughts on vulnerability?",
  "How do you cope with stress or anxiety?",
  "What's your biggest fear in life?",
  "What's a belief you hold strongly?",
  "How do you find happiness in everyday life?",
  "What's something you need to feel fulfilled in a relationship?",
  "How do you deal with setbacks or failures?",
  "What's your approach to managing finances in a relationship?",
  "How important is physical fitness or health to you?",
  "What role does religion or spirituality play in your life?",
  "How do you envision the role of family in your life?",
  "What are your thoughts on work-life balance?",
  "How do you approach decision-making in a relationship?",
  "What's a fear you've conquered?",
  "What's an area in your life you're trying to improve?",
  "How do you deal with disagreements with loved ones?",
  "What's a significant turning point in your life?",
  "How do you express gratitude?",
  "What's your philosophy on personal growth?",
  "How do you navigate changes in life?",
  "What's an act of kindness you'll never forget?",
  "What's a habit you're proud of breaking?",
  "What does self-care look like for you?",
  "How do you prioritize your mental and emotional health?",
  "What's your approach to handling criticism?",
  "How do you maintain long-term relationships?",
  "What's your idea of a perfect day together?",
  "How do you balance personal independence with relationship commitments?",
  "What's a memory that still makes you smile?",
  "What's your idea of a perfect holiday or vacation together?",
  "How do you rejuvenate yourself when you're feeling down or tired?",
  "What's a book or movie that changed your perspective on relationships?",
  "How do you handle pressure or stress in your career or personal life?",
  "What's something you've always admired about me?",
  "How do you express love and what does it look like in action?",
  "What's an important value or principle you live by?"
]
