[
  "Describe our perfect home, fantasy included.",
  "If we could start a business together, what would it be?",
  "Share a wild adventure you want us to experience together.",
  "What's an extraordinary skill you wish we both had?",
  "If we could live anywhere in the world, where would it be and why?",
  "Imagine we're on a TV show together. What's it about?",
  "What's a cause you'd like us to volunteer for together?",
  "If we could invent something, what would it be?",
  "Describe a perfect day in our retirement years.",
  "What's a joint goal you'd like us to achieve?",
  "If we could go on a year-long trip, where would we go and what would we do?",
  "What's a unique tradition you'd like to start with me?",
  "Imagine we're writing a book about our lives. What's the title?",
  "What's an unusual hobby you'd like us to try together?",
  "If we could meet any historical figure together, who would it be?",
  "What's a dream project you'd love to work on with me?",
  "If we had the chance to study something together, what would it be?",
  "What's a fantasy vacation you've always wanted to take with me?",
  "If we could have a second home, where would it be?",
  "What's an out-of-the-box activity you want us to experience?",
  "If we could create a perfect world, what would it look like?",
  "Share a grand adventure you dream of embarking on with me.",
  "What's a joint mission or project you'd love for us to tackle?",
  "Describe an ideal day we would spend together in the future.",
  "If we could change one thing about the world, what would it be?",
  "What's a shared goal or dream you think we should pursue?",
  "Tell me about a fantasy date night you've always wanted.",
  "Share a visionary idea or invention you wish we could create.",
  "If we could collaborate on a work of art, what would it be?",
  "What's a big life change you hope we can face together?",
  "Describe a future milestone you're excited to reach with me.",
  "What's a unique challenge you'd like us to conquer as a couple?",
  "Share a significant journey you want to take with me.",
  "If we could build something together, what would it be?",
  "Describe a joint venture or business idea you'd love to explore.",
  "What's a bold step or decision you'd like us to make together?",
  "Share a future dream home scenario you've imagined for us.",
  "If we could master a skill or craft together, what would it be?",
  "What's an ambitious project or goal you envision for us?",
  "Describe a fantasy scenario you'd love for us to experience.",
  "If we could design our perfect day, what would it include?",
  "Share a grand goal or achievement you want us to pursue together.",
  "What's a dream destination you'd love for us to explore?",
  "Describe a perfect celebration for one of our future anniversaries.",
  "If we could start a movement or cause together, what would it be?",
  "What's a fantasy event you'd love for us to attend together?",
  "Tell me about an epic journey you dream of us taking.",
  "What's a major life decision you look forward to making with me?",
  "Describe a future achievement you see us accomplishing together.",
  "Share a hobby or activity you'd love for us to start together.",
  "If we could build our dream house, what unique features would it have?",
  "What's a daring adventure you want us to experience?",
  "Describe a big dream for our relationship that you hope comes true.",
  "What's a future chapter of our lives you're excited to write?",
  "If we could create a piece of art together, what would it be?",
  "Share a major life change you hope we'll navigate together.",
  "What's a joint bucket list item you'd like us to check off?",
  "Describe a dream project you'd love to work on with me.",
  "If we could make a significant impact in the world, how would we do it?",
  "What's an extraordinary experience you want to share with me?",
  "If we could design a perfect future, what would it include?",
  "Share a grand goal we should aim for together.",
  "What's a dream vacation you want us to take?",
  "Describe how we would celebrate our love in the future.",
  "If we could champion a cause, what would it be?",
  "What's a fantasy event you wish we could experience?",
  "Tell me about a legendary trip you dream of us taking.",
  "What's a major life choice you're excited to make with me?",
  "Describe a future success we'll achieve together.",
  "Share an activity or hobby we should start as a couple.",
  "If we built our dream house, what special things would it have?",
  "What's a thrilling adventure you want us to undertake?",
  "Describe a bright hope for our relationship you hold dear.",
  "What's a new chapter you're eager to start with me?",
  "If we could create art together, what would we make?",
  "Share a significant change you hope we'll go through together.",
  "What's a shared bucket list experience you want for us?",
  "Describe a collaborative project you'd love for us to do.",
  "If we could make a difference in the world, how would we do it?",
  "What's an extraordinary experience you want to share with me?"
]
